In [1]:
import pandas as pd
import numpy as np
from sklearn.metrics import recall_score
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
cab_data = pd.read_csv("Data/Cab_Data.csv")
customer_id = pd.read_csv("Data/Customer_ID.csv")
transaction_id = pd.read_csv("Data/Transaction_ID.csv")
city = pd.read_csv("Data/City.csv")

In [3]:
cab_data.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,42376,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,42372,Pink Cab,ATLANTA GA,8.73,114.62,97.776

In [4]:
cab_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  int64
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: float64(3), int64(2), object(2)
memory usage: 19.2+ MB

In [5]:
customer_id.head()

   Customer ID Gender  Age  Income (USD/Month)
0        29290   Male   28               10813
1        27703   Male   27                9237
2        28712   Male   53               11242
3        28020   Male   23               23327
4        27182   Male   33                8536

In [6]:
customer_id.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49171 entries, 0 to 49170
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         49171 non-null  int64
 1   Gender              49171 non-null  object
 2   Age                 49171 non-null  int64
 3   Income (USD/Month)  49171 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [7]:
transaction_id.head()

   Transaction ID  Customer ID Payment_Mode
0        10000011        29290         Card
1        10000012        27703         Card
2        10000013        28712         Cash
3        10000014        28020         Cash
4        10000015        27182         Card

In [8]:
transaction_id.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440098 entries, 0 to 440097
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  440098 non-null  int64
 1   Customer ID     440098 non-null  int64
 2   Payment_Mode    440098 non-null  object
dtypes: int64(2), object(1)
memory usage: 10.1+ MB

In [9]:
city.head()

             City   Population      Users
0     NEW YORK NY   8,405,837    302,149
1      CHICAGO IL   1,955,130    164,468
2  LOS ANGELES CA   1,595,037    144,132
3        MIAMI FL   1,339,155     17,675
4  SILICON VALLEY   1,177,609     27,247

In [10]:
city.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     object
 2   Users       20 non-null     object
dtypes: object(3)
memory usage: 608.0+ bytes

In [19]:
all_cols = list(set(transaction_id.columns.to_list() + city.columns.to_list() + cab_data.columns.to_list() + customer_id.columns.to_list()))
master_df = pd.DataFrame(columns = all_cols)

In [20]:
all_cols

['Population',
 'Customer ID',
 'Transaction ID',
 'Users',
 'Company',
 'Price Charged',
 'Gender',
 'Payment_Mode',
 'Income (USD/Month)',
 'KM Travelled',
 'City',
 'Age',
 'Date of Travel',
 'Cost of Trip']

In [21]:
master_df.columns

Index(['Population', 'Customer ID', 'Transaction ID', 'Users', 'Company',
       'Price Charged', 'Gender', 'Payment_Mode', 'Income (USD/Month)',
       'KM Travelled', 'City', 'Age', 'Date of Travel', 'Cost of Trip'],
      dtype='object')

In [22]:
master_df

Empty DataFrame
Columns: [Population, Customer ID, Transaction ID, Users, Company, Price Charged, Gender, Payment_Mode, Income (USD/Month), KM Travelled, City, Age, Date of Travel, Cost of Trip]
Index: []

In [29]:
new_cols = []
for col in master_df.columns:
    col = col.replace(" ", "_")
    col = col.lower()
    new_cols.append(col)

In [30]:
master_df.columns = new_cols

In [31]:
master_df

Empty DataFrame
Columns: [population, customer_id, transaction_id, users, company, price_charged, gender, payment_mode, income_(usd/month), km_travelled, city, age, date_of_travel, cost_of_trip]
Index: []

In [137]:
cab_cols = []
for col in cab_data.columns:
    col = col.replace(" ", "_")
    col = col.lower()
    cab_cols.append(col)
cab_data.columns = cab_cols

master_df = pd.concat([master_df, cab_data])

In [138]:
master_df

,population,customer_id,transaction_id,users,company,price_charged,gender,payment_mode,income_(usd/month),km_travelled,city,age,date_of_travel,cost_of_trip
0,NaN,NaN,10000011,NaN,Pink Cab,370.95,NaN,NaN,NaN,30.45,ATLANTA GA,NaN,42377,313.635
1,NaN,NaN,10000012,NaN,Pink Cab,358.52,NaN,NaN,NaN,28.62,ATLANTA GA,NaN,42375,334.854
2,NaN,NaN,10000013,NaN,Pink Cab,125.2,NaN,NaN,NaN,9.04,ATLANTA GA,NaN,42371,97.632
3,NaN,NaN,10000014,NaN,Pink Cab,377.4,NaN,NaN,NaN,33.17,ATLANTA GA,NaN,42376,351.602
4,NaN,NaN,10000015,NaN,Pink Cab,114.62,NaN,NaN,NaN,8.73,ATLANTA GA,NaN,42372,97.776
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
359387,NaN,NaN,10440101,NaN,Yellow Cab,69.24,NaN,NaN,NaN,4.8,WASHINGTON DC,NaN,43108,63.36
359388,NaN,NaN,10440104,NaN,Yellow Cab,113.75,NaN,NaN,NaN,8.4,WASHINGTON DC,NaN,43104,106.848
359389,NaN,NaN,10440105,NaN,Yellow Cab,437.07,NaN,NaN,NaN,27.75,WASHINGTON DC,NaN,43105,349.65
359390,NaN,NaN,10440106,NaN,Yellow Cab,146.19,NaN,NaN,NaN,8.8,WASHINGTON DC,NaN,43105,114.048
359391,NaN,NaN,10440107,NaN,Yellow Cab,191.58,NaN,NaN,NaN,12.76,WASHINGTON DC,NaN,43102,177.6192

In [139]:
cities = city["City"].value_counts().index

for c in cities:
    city_len = len(master_df[master_df["city"] == c]["population"])
    city_pop = int(city[city["City"] == c]["Population"].values[0].strip().replace(",", ""))
    city_users = int(city[city["City"] == c]["Users"].values[0].strip().replace(",", ""))
    master_df.loc[master_df["city"] == c, "population"] = [city_pop]*city_len
    master_df.loc[master_df["city"] == c, "users"] = [city_users]*city_len

In [140]:
master_df

,population,customer_id,transaction_id,users,company,price_charged,gender,payment_mode,income_(usd/month),km_travelled,city,age,date_of_travel,cost_of_trip
0,814885,NaN,10000011,24701,Pink Cab,370.95,NaN,NaN,NaN,30.45,ATLANTA GA,NaN,42377,313.635
1,814885,NaN,10000012,24701,Pink Cab,358.52,NaN,NaN,NaN,28.62,ATLANTA GA,NaN,42375,334.854
2,814885,NaN,10000013,24701,Pink Cab,125.2,NaN,NaN,NaN,9.04,ATLANTA GA,NaN,42371,97.632
3,814885,NaN,10000014,24701,Pink Cab,377.4,NaN,NaN,NaN,33.17,ATLANTA GA,NaN,42376,351.602
4,814885,NaN,10000015,24701,Pink Cab,114.62,NaN,NaN,NaN,8.73,ATLANTA GA,NaN,42372,97.776
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
359387,418859,NaN,10440101,127001,Yellow Cab,69.24,NaN,NaN,NaN,4.8,WASHINGTON DC,NaN,43108,63.36
359388,418859,NaN,10440104,127001,Yellow Cab,113.75,NaN,NaN,NaN,8.4,WASHINGTON DC,NaN,43104,106.848
359389,418859,NaN,10440105,127001,Yellow Cab,437.07,NaN,NaN,NaN,27.75,WASHINGTON DC,NaN,43105,349.65
359390,418859,NaN,10440106,127001,Yellow Cab,146.19,NaN,NaN,NaN,8.8,WASHINGTON DC,NaN,43105,114.048
359391,418859,NaN,10440107,127001,Yellow Cab,191.58,NaN,NaN,NaN,12.76,WASHINGTON DC,NaN,43102,177.6192

In [141]:
def trans_user(t):
    global transaction_id
    user = int(transaction_id[transaction_id["Transaction ID"] == t]["Customer ID"].values[0])
    return user
def trans_pay(t):
    global transaction_id
    payment = transaction_id[transaction_id["Transaction ID"] == t]["Payment_Mode"].values[0]
    return payment

In [142]:
master_df["customer_id"] = master_df["transaction_id"].apply(trans_user)
master_df["payment_mode"] = master_df["transaction_id"].apply(trans_pay)

In [143]:
master_df

,population,customer_id,transaction_id,users,company,price_charged,gender,payment_mode,income_(usd/month),km_travelled,city,age,date_of_travel,cost_of_trip
0,814885,29290,10000011,24701,Pink Cab,370.95,NaN,Card,NaN,30.45,ATLANTA GA,NaN,42377,313.635
1,814885,27703,10000012,24701,Pink Cab,358.52,NaN,Card,NaN,28.62,ATLANTA GA,NaN,42375,334.854
2,814885,28712,10000013,24701,Pink Cab,125.2,NaN,Cash,NaN,9.04,ATLANTA GA,NaN,42371,97.632
3,814885,28020,10000014,24701,Pink Cab,377.4,NaN,Cash,NaN,33.17,ATLANTA GA,NaN,42376,351.602
4,814885,27182,10000015,24701,Pink Cab,114.62,NaN,Card,NaN,8.73,ATLANTA GA,NaN,42372,97.776
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
359387,418859,52392,10440101,127001,Yellow Cab,69.24,NaN,Cash,NaN,4.8,WASHINGTON DC,NaN,43108,63.36
359388,418859,53286,10440104,127001,Yellow Cab,113.75,NaN,Cash,NaN,8.4,WASHINGTON DC,NaN,43104,106.848
359389,418859,52265,10440105,127001,Yellow Cab,437.07,NaN,Cash,NaN,27.75,WASHINGTON DC,NaN,43105,349.65
359390,418859,52175,10440106,127001,Yellow Cab,146.19,NaN,Card,NaN,8.8,WASHINGTON DC,NaN,43105,114.048
359391,418859,52917,10440107,127001,Yellow Cab,191.58,NaN,Card,NaN,12.76,WASHINGTON DC,NaN,43102,177.6192

In [144]:
def user_gender(u):
    global customer_id
    gender = customer_id[customer_id["Customer ID"] == u]["Gender"].values[0]
    return gender
def user_age(u):
    global customer_id
    age = customer_id[customer_id["Customer ID"] == u]["Age"].values[0]
    return age
def user_income(u):
    global customer_id
    income = customer_id[customer_id["Customer ID"] == u]["Income (USD/Month)"].values[0]
    return income

In [145]:
master_df["gender"] = master_df["customer_id"].apply(user_gender)
master_df["age"] = master_df["customer_id"].apply(user_age)
master_df["income_(usd/month)"] = master_df["customer_id"].apply(user_income)

In [146]:
master_df

,population,customer_id,transaction_id,users,company,price_charged,gender,payment_mode,income_(usd/month),km_travelled,city,age,date_of_travel,cost_of_trip
0,814885,29290,10000011,24701,Pink Cab,370.95,Male,Card,10813,30.45,ATLANTA GA,28,42377,313.635
1,814885,27703,10000012,24701,Pink Cab,358.52,Male,Card,9237,28.62,ATLANTA GA,27,42375,334.854
2,814885,28712,10000013,24701,Pink Cab,125.2,Male,Cash,11242,9.04,ATLANTA GA,53,42371,97.632
3,814885,28020,10000014,24701,Pink Cab,377.4,Male,Cash,23327,33.17,ATLANTA GA,23,42376,351.602
4,814885,27182,10000015,24701,Pink Cab,114.62,Male,Card,8536,8.73,ATLANTA GA,33,42372,97.776
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
359387,418859,52392,10440101,127001,Yellow Cab,69.24,Male,Cash,15651,4.8,WASHINGTON DC,24,43108,63.36
359388,418859,53286,10440104,127001,Yellow Cab,113.75,Male,Cash,6528,8.4,WASHINGTON DC,32,43104,106.848
359389,418859,52265,10440105,127001,Yellow Cab,437.07,Male,Cash,7966,27.75,WASHINGTON DC,56,43105,349.65
359390,418859,52175,10440106,127001,Yellow Cab,146.19,Male,Card,6423,8.8,WASHINGTON DC,32,43105,114.048
359391,418859,52917,10440107,127001,Yellow Cab,191.58,Male,Card,11284,12.76,WASHINGTON DC,20,43102,177.6192

In [147]:
master_df.isna().sum()

population            0
customer_id           0
transaction_id        0
users                 0
company               0
price_charged         0
gender                0
payment_mode          0
income_(usd/month)    0
km_travelled          0
city                  0
age                   0
date_of_travel        0
cost_of_trip          0
dtype: int64

In [148]:
master_df.to_csv("Data/master_data.csv", index=False)